FinPulse/src/DataProcessors/ПлатёжныйКалендарь/ПлатёжныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПлатёжныйКалендарь</name>
</mdclass:DataProcessor>

FinPulse/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счёт</name>
    <type>
      <types>CatalogRef.Счёт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контраагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДДс</name>
    <type>
      <types>EnumRef.ТипДдс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Измерение</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

FinPulse/src/AccumulationRegisters/ПланДенежныеСредства/ПланДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счёт</name>
    <type>
      <types>CatalogRef.Счёт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

FinPulse/src/DataProcessors/ПлатёжныйКалендарь/Forms/Форма/Module.bsl
&НаСервере
Процедура КнопкаНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|	ДенежныеСредстваОстаткиИОбороты.Счёт КАК Счёт
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты КАК ДенежныеСредстваОстаткиИОбороты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СтруктурСчёт = Новый Соответствие();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктурСчёт.Вставить(ВыборкаДетальныеЗаписи.Счёт, ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток);
	КонецЦикла;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПланДенежныеСредстваОбороты.Счёт КАК Счёт,
		|	ПланДенежныеСредстваОбороты.СтатьяДДС КАК СтатьяДДС,
		|	ПланДенежныеСредстваОбороты.СуммаПриход КАК СуммаПриход,
		|	ПланДенежныеСредстваОбороты.СуммаРасход КАК СуммаРасход,
		|	ПланДенежныеСредстваОбороты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.ПланДенежныеСредства.Обороты(&НачалоПериода,, Секунда,) КАК ПланДенежныеСредстваОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
		
		Запрос.УстановитьПараметр("НачалоПериода", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	НачальныйОстаток = 1;
	КонечныйОстаток = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СтруктурСчёт.Получить(ВыборкаДетальныеЗаписи.Счёт) <> Неопределено Тогда
			НачальныйОстаток = СтруктурСчёт.Получить(ВыборкаДетальныеЗаписи.Счёт);
		Иначе
			НачальныйОстаток = 0;
		КонецЕсли;
		КонечныйОстаток = НачальныйОстаток + ВыборкаДетальныеЗаписи.СуммаПриход - ВыборкаДетальныеЗаписи.СуммаРасход;
		
		НоваяСтрока = ПлатёжныйКалендарь.Добавить();
		
		НоваяСтрока.Дата = ВыборкаДетальныеЗаписи.Период;
		НоваяСтрока.НачальныйОстаток = НачальныйОстаток;
		НоваяСтрока.Счёт = ВыборкаДетальныеЗаписи.Счёт;
		НоваяСтрока.Статья = ВыборкаДетальныеЗаписи.СтатьяДДС;
		НоваяСтрока.СуммаПриход = ВыборкаДетальныеЗаписи.СуммаПриход;
		НоваяСтрока.СуммаРасход = ВыборкаДетальныеЗаписи.СуммаРасход;
		НоваяСтрока.КонечныйОстаток = КонечныйОстаток;
		СтруктурСчёт.Вставить(ВыборкаДетальныеЗаписи.Счёт, КонечныйОстаток);
		Если КонечныйОстаток < 0 Тогда
			Сообщить(Строка(ВыборкаДетальныеЗаписи.Период) + " на счету " + Строка(ВыборкаДетальныеЗаписи.Счёт) + " баланс ниже нуля");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка(Команда)
	ПлатёжныйКалендарь.Очистить();
	КнопкаНаСервере();
КонецПроцедуры
